CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_fmc.h
/* bits definitions */
/* FMC_KEY */
#define FMC_KEY_KEY                     BITS(0,31)                                       /*!< FMC_CTL unlock key */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                 BITS(0,31)                                       /*!< option bytes unlock key */

/* FMC_STAT */
#define FMC_STAT_BUSY                   BIT(0)                                           /*!< flash busy flag */
#define FMC_STAT_OBERR                  BIT(3)                                           /*!< option bytes error flag */
#define FMC_STAT_WPERR                  BIT(4)                                           /*!< erase/program protection error flag */
#define FMC_STAT_ENDF                   BIT(5)                                           /*!< end of operation flag */
 
/* FMC_CTL */
#define FMC_CTL_PG                      BIT(0)                                           /*!< main flash program command */
#define FMC_CTL_PER                     BIT(1)                                           /*!< main flash page erase command */
#define FMC_CTL_MER                     BIT(2)                                           /*!< main flash mass erase command */
#define FMC_CTL_START                   BIT(6)                                           /*!< send erase command to FMC */
#define FMC_CTL_LK                      BIT(7)                                           /*!< FMC_CTL lock */
#define FMC_CTL_OBWEN                   BIT(9)                                           /*!< FMC_SECMx (x=0,1,2,3) / FMC_NODECx (x=0,1,2,3) / FMC_OFRG / FMC_OFVR write enable */
#define FMC_CTL_ERRIE                   BIT(10)                                          /*!< error interrupt enable */
#define FMC_CTL_ENDIE                   BIT(12)                                          /*!< end of operation interrupt enable */
#define FMC_CTL_OBSTART                 BIT(14)                                          /*!< option bytes modification start */
#define FMC_CTL_OBRLD                   BIT(15)                                          /*!< option bytes reload */

/* FMC_ADDR */
#define FMC_ADDR_ADDR                   BITS(0,31)                                       /*!< address of flash to be erased/programmed */

/* FMC_OBSTAT */
#define FMC_OBSTAT_SPC_P5               BIT(0)                                           /*!< flash security protection level 0.5 state */
#define FMC_OBSTAT_SPC                  BIT(1)                                           /*!< flash security protection level 1 state */
#define FMC_OBSTAT_WP                   BIT(2)                                           /*!< write/erase protection state */
#define FMC_OBSTAT_TZEN_STAT            BIT(3)                                           /*!< trustzone state */
#define FMC_OBSTAT_NQSPI                BIT(4)                                           /*!< memory structure is FMC mode or QSPI mode */
#define FMC_OBSTAT_FMCOB                BIT(5)                                           /*!< whether the option byte exist or not */

/* FMC_SECKEY */
#define FMC_SECKEY_SECKEY               BITS(0,31)                                       /*!< FMC_SECCTL unlock key */

/* FMC_SECSTAT */
#define FMC_SECSTAT_SECBUSY             BIT(0)                                           /*!< flash secure busy flag */
#define FMC_SECSTAT_SECERR              BIT(3)                                           /*!< flash secure error flag */
#define FMC_SECSTAT_SECWPERR            BIT(4)                                           /*!< secure erase/program protection error flag */
#define FMC_SECSTAT_SECENDF             BIT(5)                                           /*!< secure end of operation flag */
 
/* FMC_SECCTL */
#define FMC_SECCTL_SECPG                BIT(0)                                           /*!< main flash secure program command */
#define FMC_SECCTL_SECPER               BIT(1)                                           /*!< main flash secure page erase command */
#define FMC_SECCTL_SECMER               BIT(2)                                           /*!< main flash secure mass erase command */
#define FMC_SECCTL_SECSTART             BIT(6)                                           /*!< send secure erase command to FMC */
#define FMC_SECCTL_SECLK                BIT(7)                                           /*!< FMC_SECCTL lock */
#define FMC_SECCTL_SECERRIE             BIT(10)                                          /*!< secure error interrupt enable */
#define FMC_SECCTL_SECENDIE             BIT(12)                                          /*!< secure end of operation interrupt enable */

/* FMC_SECADDR */
#define FMC_SECADDR_SECADDR             BITS(0,31)                                       /*!< secure address of flash to be erased/programmed */

/* FMC_OBR */
#define FMC_OBR_SPC                     BITS(0,7)                                        /*!< option bytes security protection code */
#define FMC_OBR_SRAM1_RST               BIT(12)                                          /*!< option bytes SRAM1 erase when system reset */
#define FMC_OBR_TZEN                    BIT(15)                                          /*!< option bytes trustzone enable */

/* FMC_OBUSER */
#define FMC_OBUSER_USER                 BITS(0,15)                                       /*!< option bytes user code */

/* FMC_SECMCFG0 */
#define FMC_SECMCFG0_SECM0_SPAGE        BITS(0,9)                                        /*!< start page of secure mark area 0 */
#define FMC_SECMCFG0_SECM0_EPAGE        BITS(16,25)                                      /*!< end page of secure mark area 0 */

/* FMC_DMP0 */
#define FMC_DMP0_DMP0_EPAGE             BITS(0,9)                                        /*!< end page of DMP area 0 */
#define FMC_DMP0_DMP0EN                 BIT(31)                                          /*!< DMP area 0 enable */

/* FMC_OBWRP0 */
#define FMC_OBWRP0_WRP0_SPAGE           BITS(0,9)                                        /*!< start page of write protection area 0 */
#define FMC_OBWRP0_WRP0_EPAGE           BITS(16,25)                                      /*!< end page of write protection area 0 */

