CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_fmc.h
/* FMC_SECMCFG1 */
#define FMC_SECMCFG1_SECM1_SPAGE        BITS(0,9)                                        /*!< start page of secure mark area 1 */
#define FMC_SECMCFG1_SECM1_EPAGE        BITS(16,25)                                      /*!< end page of secure mark area 1 */

/* FMC_DMP1 */
#define FMC_DMP1_DMP1_EPAGE             BITS(0,9)                                        /*!< end page of DMP area 1 */
#define FMC_DMP1_DMP1EN                 BIT(31)                                          /*!< DMP area 1 enable */

/* FMC_OBWRP1 */
#define FMC_OBWRP1_WRP1_SPAGE           BITS(0,9)                                        /*!< start page of write protection area 1 */
#define FMC_OBWRP1_WRP1_EPAGE           BITS(16,25)                                      /*!< end page of write protection area 1 */

/* FMC_SECMCFG2 */
#define FMC_SECMCFG2_SECM2_SPAGE        BITS(0,9)                                        /*!< start page of secure mark area 2 */
#define FMC_SECMCFG2_SECM2_EPAGE        BITS(16,25)                                      /*!< end page of secure mark area 2 */

/* FMC_SECMCFG3 */
#define FMC_SECMCFG3_SECM3_SPAGE        BITS(0,9)                                        /*!< start page of secure mark area 3 */
#define FMC_SECMCFG3_SECM3_EPAGE        BITS(16,25)                                      /*!< end page of secure mark area 3 */

/* FMC_NODEC0 */
#define FMC_NODEC0_NODEC0_SPAGE         BITS(0,9)                                        /*!< start page of NO-RTDEC region 0 */
#define FMC_NODEC0_NODEC0_EPAGE         BITS(16,25)                                      /*!< end page of NO-RTDEC region 0 */

/* FMC_NODEC1 */
#define FMC_NODEC1_NODEC1_SPAGE         BITS(0,9)                                        /*!< start page of NO-RTDEC region 1 */
#define FMC_NODEC1_NODEC1_EPAGE         BITS(16,25)                                      /*!< end page of NO-RTDEC region 1 */

/* FMC_NODEC2 */
#define FMC_NODEC2_NODEC2_SPAGE         BITS(0,9)                                        /*!< start page of NO-RTDEC region 2 */
#define FMC_NODEC2_NODEC2_EPAGE         BITS(16,25)                                      /*!< end page of NO-RTDEC region 2 */

/* FMC_NODEC3 */
#define FMC_NODEC3_NODEC3_SPAGE         BITS(0,9)                                        /*!< start page of NO-RTDEC region 3 */
#define FMC_NODEC3_NODEC3_EPAGE         BITS(16,25)                                      /*!< end page of NO-RTDEC region 3 */

/* FMC_OFRG */
#define FMC_OFRG_OF_SPAGE               BITS(0,12)                                       /*!< start page of offset region */
#define FMC_OFRG_OF_EPAGE               BITS(16,28)                                      /*!< end page of offset region */

/* FMC_OFVR */
#define FMC_OFVR_OF_VALUE               BITS(0,12)                                       /*!< offset value */

/* FMC_DMPCTL */
#define FMC_DMPCTL_DMP0_ACCCFG          BIT(0)                                           /*!< DMP area 0 access configuration */
#define FMC_DMPCTL_DMP1_ACCCFG          BIT(1)                                           /*!< DMP area 1 access configuration */

/* FMC_PRIV_CFG */
#define FMC_PRIVCFG_FMC_PRIV            BIT(0)                                           /*!< privileged access only */

/* FMC_PID */
#define FMC_PID_PID                     BITS(0,31)                                       /*!< product ID */

/* constants definitions */
/* fmc state */
typedef enum
{
    FMC_READY,                                                                           /*!< the operation has been completed */
    FMC_BUSY,                                                                            /*!< the operation is in progress */
    FMC_WPERR,                                                                           /*!< erase/program protection error */
    FMC_TOERR,                                                                           /*!< timeout error */
    FMC_OBERR,                                                                           /*!< option bytes error */
    FMC_SECERR,                                                                          /*!< secure error, only available in secure mode */
}fmc_state_enum;

/* unlock key */
#define UNLOCK_KEY0                     ((uint32_t)0x45670123U)                          /*!< unlock key 0 */
#define UNLOCK_KEY1                     ((uint32_t)0xCDEF89ABU)                          /*!< unlock key 1 */
#define UNLOCK_SECKEY0                  ((uint32_t)0x45670123U)                          /*!< secure unlock key 0 */
#define UNLOCK_SECKEY1                  ((uint32_t)0xCDEF89ABU)                          /*!< secure unlock key 1 */

/* read protection configuration */
#define FMC_NSPC                        ((uint8_t)0xAAU)                                 /*!< no security protection */
#define FMC_SPC_P0_5                    ((uint8_t)0x55U)                                 /*!< security protection level 0.5 */
#define FMC_SPC_P1                      ((uint8_t)0xCCU)                                 /*!< security protection level 1 */

/* option byte wrtie protection area register x(x=0,1) */
#define OBWRP_INDEX0                    ((uint32_t)0x00000000U)                          /*!< FMC_OBWRP0 register index */
#define OBWRP_INDEX1                    ((uint32_t)0x00000001U)                          /*!< FMC_OBWRP1 register index */

/* secure mark configuration register x(x=0,1,2,3) */
#define SECM_INDEX0                     ((uint32_t)0x00000000U)                          /*!< FMC_SECMCFG0 register index */
#define SECM_INDEX1                     ((uint32_t)0x00000001U)                          /*!< FMC_SECMCFG1 register index */
#define SECM_INDEX2                     ((uint32_t)0x00000002U)                          /*!< FMC_SECMCFG2 register index */
#define SECM_INDEX3                     ((uint32_t)0x00000003U)                          /*!< FMC_SECMCFG3 register index */

/* DMP mark configuration register x(x=0,1) */
#define DMP_INDEX0                      ((uint32_t)0x00000000U)                          /*!< FMC_DMP0 register index */
#define DMP_INDEX1                      ((uint32_t)0x00000001U)                          /*!< FMC_DMP1 register index */

