CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_fmc.h
/* NO RTDEC configuration register x(x=0,1,2,3) */
#define NODEC_INDEX0                    ((uint32_t)0x00000000U)                          /*!< FMC_NODEC0 register index */
#define NODEC_INDEX1                    ((uint32_t)0x00000001U)                          /*!< FMC_NODEC1 register index */
#define NODEC_INDEX2                    ((uint32_t)0x00000002U)                          /*!< FMC_NODEC2 register index */
#define NODEC_INDEX3                    ((uint32_t)0x00000003U)                          /*!< FMC_NODEC3 register index */

/* FMC flags */
#define OB_FLAG_NSPC                    ((uint32_t)0x00000000U)                          /*!< flash security protection level 0 state */
#define OB_FLAG_SPC1                    FMC_OBSTAT_SPC                                   /*!< flash security protection level 0.5 state */
#define OB_FLAG_SPC0_5                  FMC_OBSTAT_SPC_P5                                /*!< flash security protection level 1 state */

/* FMC interrupt enable */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_INT_ERR                     FMC_SECCTL_SECERRIE                              /*!< FMC secure error interrupt enable */
#define FMC_INT_END                     FMC_SECCTL_SECENDIE                              /*!< FMC secure end of operation interrupt enable */
#else
#define FMC_INT_ERR                     FMC_CTL_ERRIE                                    /*!< FMC error interrupt enable */
#define FMC_INT_END                     FMC_CTL_ENDIE                                    /*!< FMC end of operation interrupt enable */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* FMC flags */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_FLAG_BUSY                   FMC_SECSTAT_SECBUSY                              /*!< FMC busy flag */
#define FMC_FLAG_SECERR                 FMC_SECSTAT_SECERR                               /*!< FMC secure error flag */
#define FMC_FLAG_WPERR                  FMC_SECSTAT_SECWPERR                             /*!< FMC secure erase/program protection error flag */
#define FMC_FLAG_END                    FMC_SECSTAT_SECENDF                              /*!< FMC secure end of operation flag */
#else
#define FMC_FLAG_BUSY                   FMC_STAT_BUSY                                    /*!< FMC busy flag */
#define FMC_FLAG_WPERR                  FMC_STAT_WPERR                                   /*!< FMC erase/program protection error flag */
#define FMC_FLAG_END                    FMC_STAT_ENDF                                    /*!< FMC end of operation flag */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
#define FMC_FLAG_OBERR                  FMC_STAT_OBERR                                   /*!< option bytes error flag */

/* FMC interrupt flags */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_INT_FLAG_SECERR             FMC_SECSTAT_SECERR                               /*!< FMC secure error interrupt flag */
#define FMC_INT_FLAG_WPERR              FMC_SECSTAT_SECWPERR                             /*!< FMC secure erase/program protection error interrupt flag */
#define FMC_INT_FLAG_END                FMC_SECSTAT_SECENDF                              /*!< FMC secure end of operation interrupt flag */
#else
#define FMC_INT_FLAG_WPERR              FMC_STAT_WPERR                                   /*!< FMC erase/program protection error interrupt flag */
#define FMC_INT_FLAG_END                FMC_STAT_ENDF                                    /*!< FMC end of operation interrupt flag */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* FMC timeout */
#define FMC_TIMEOUT_COUNT              ((uint32_t)0x01000000U)                           /*!< FMC timeout count value */

/* function declarations */
#ifndef GD32W515P0
/* FMC main memory programming functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* FMC erase page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* FMC erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* FMC program a word at the corresponding address */
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data);
/* FMC program continuously at the corresponding address */
fmc_state_enum fmc_continuous_program(uint32_t address, uint32_t data[], uint32_t size);
#endif /* GD32W515PI and GD32W515TX */

/* enable SRAM1 reset automatically function */
void sram1_reset_enable(void);
/* disable SRAM1 reset automatically function */
void sram1_reset_disable(void);
/* enable the privileged access */
void fmc_privilege_enable(void);
/* disable the privileged access */
void fmc_privilege_disable(void);

/* FMC option bytes programming functions */
/* unlock the option bytes operation */
void ob_unlock(void);
/* lock the option bytes operation */
void ob_lock(void);

#ifndef GD32W515P0
/* send option bytes modification start command */
void ob_start(void);
/* reload option bytes */
void ob_reload(void);
/* configure the option bytes security protection */
fmc_state_enum ob_security_protection_config(uint8_t ob_spc);
/* enable trustzone */
fmc_state_enum ob_trustzone_enable(void);
/* disable trustzone */
ErrStatus ob_trustzone_disable(void);
/* program option bytes USER */
fmc_state_enum ob_user_write(uint16_t ob_user);
/* configure write protection pages */
fmc_state_enum ob_write_protection_config(uint32_t wrp_spage, uint32_t wrp_epage, uint32_t wrp_register_index);
/* configure secure mark pages */
void ob_secmark_config(uint32_t secm_spage, uint32_t secm_epage, uint32_t secm_register_index);
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/* enable DMP region access right */
void ob_dmp_access_enable(uint32_t dmp_register_index);
/* disable DMP region access right */
void ob_dmp_access_disable(uint32_t dmp_register_index);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
/* configure DMP secure pages */
ErrStatus ob_dmp_config(uint32_t dmp_epage, uint32_t dmp_register_index);
/* enable DMP function */
fmc_state_enum ob_dmp_enable(uint32_t dmp_register_index);
/* disable DMP function */
fmc_state_enum ob_dmp_disable(uint32_t dmp_register_index);
/* configure NO-RTDEC pages */
void fmc_no_rtdec_config(uint32_t nodec_spage, uint32_t nodec_epage, uint32_t nodec_register_index);
#endif /* GD32W515PI and GD32W515TX */

/* FMC read offset function */
/* configure offset region */
void fmc_offset_region_config(uint32_t of_spage, uint32_t of_epage);
/* configure offset value */
void fmc_offset_value_config(uint32_t of_value);

#ifndef GD32W515P0
/* get option bytes write protection state, only applies to get the status of write/erase protection setting by EFUSE */
FlagStatus ob_write_protection_get(void);
/* get the value of option bytes USER */
uint16_t ob_user_get(void);
#endif /* GD32W515PI and GD32W515TX */

/* get option bytes security protection state */
FlagStatus ob_security_protection_flag_get(uint32_t spc_state);
/* get trustzone state */
FlagStatus ob_trustzone_state_get(void);
/* get the state of MCU memory structure is FMC mode or QSPI mode */
FlagStatus ob_memory_mode_state_get(void);
/* get the state of whether the option byte exist or not */
FlagStatus ob_exist_state_get(void);

#ifndef GD32W515P0
/* FMC interrupts and flags management functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(uint32_t flag);
/* clear the FMC flag */
void fmc_flag_clear(uint32_t flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(uint32_t interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(uint32_t interrupt);
/* get FMC interrupt flag */
FlagStatus fmc_interrupt_flag_get(uint32_t flag);
/* clear FMC interrupt flag */
void fmc_interrupt_flag_clear(uint32_t flag);
#endif /* GD32W515PI and GD32W515TX */

#endif /* GD32W51X_FMC_H */
